<img src="https://raw.githubusercontent.com/afo/data-x-plaksha/master/imgsource/dx_logo.png" align="left"></img><br><br><br><br>

## Plaksha SQL assignment

---

## Submission details:

Please submit this as a Jupyter Notebook and a PDF of your results (both should show output). Also push your solutions to Github.

For the submision create a local database with `sqlite3` or `sqlalchemy` in a Jupyter notebook and make the queries either with a cursor object (and then print the results) or by using pandas `pd.read_sql_query()`.

___

When completing this homework you can experiment with SQL commands by utilizing this great online editor:

https://www.w3schools.com/sql/trysql.asp?filename=trysql_select_all

There are already some tables in the online Database, namely:

`Categories, Employees, OrderDetails, Orders, Products, Shippers, and Suppliers.`

If you want you can drop them by running  `DROP TABLE [table-name];` (or just keep them).

___

## Exercises:

First create a table called students. It has the columns: 'student_id', 'name', 'major', 'gpa' and 'enrollment_date' We will use a new form of `CREATE TABLE` expression to produce this table.

Note that you can improve this and are welcome to do so -- e.g. by specifying for example a PRIMARY KEY and a FOREIGN KEY in Q2 :)

    CREATE TABLE students AS
        SELECT 1 AS student_id, "John" AS name, "Computer Science" AS major, 3.5 AS gpa, "01-01-2022" AS enrollment_date UNION
        SELECT 2, "Jane", "Physics", 3.8, "01-02-2022" UNION
        SELECT 3, "Bob", "Engineering", 3.0, "01-03-2022" UNION
        SELECT 4, "Samantha", "Physics", 3.9, "01-04-2022" UNION
        SELECT 5, "James", "Engineering", 3.7, "01-05-2022" UNION
        SELECT 6, "Emily", "Computer Science", 3.6, "01-06-2022" UNION
        SELECT 7, "Michael", "Computer Science", 3.2, "01-07-2022" UNION
        SELECT 8, "Jessica", "Engineering", 3.8, "01-08-2022" UNION
        SELECT 9, "Jacob", "Physics", 3.4, "01-09-2022" UNION
        SELECT 10, "Ashley", "Physics", 3.9, "01-10-2022";


## Q1 Simple SELECTS (on the students table)
1. SELECT all records in the table.
2. SELECT students whose major is "Computer Science".
3. SELECT all unique majors (use SELECT DISTINCT) and order them by name, descending order (i.e. Physics first).
4. SELECT all students that have an 'e' in their name and order them by gpa in ascending order.


## Q2 Joins

Create a new table called courses, which indicates the courses taken by the students. 

Create the table by running:
	
    CREATE TABLE courses AS
        SELECT 1 AS course_id, "Python programming" AS course_name, 1 AS student_id, "A" AS grade UNION
        SELECT 2, "Data Structures", 2, "B" UNION
        SELECT 3, "Database Systems", 3, "B" UNION
        SELECT 1, "Python programming", 4, "A" UNION
        SELECT 4, "Quantum Mechanics", 5, "C" UNION
        SELECT 1, "Python programming", 6, "F" UNION
        SELECT 2, "Data Structures", 7, "C" UNION
        SELECT 3, "Database Systems", 8, "A" UNION
        SELECT 4, "Quantum Mechanics", 9, "A" UNION
        SELECT 2, "Data Structures", 10, "F";

1. COUNT the number of unique courses.
2. JOIN the tables students and courses and COUNT the number of students with the major Computer Science taking the course Python programming.
3. JOIN the tables students and courses and select the students who have grades higher than "C", only show their name, major, gpa, course_name and grade.


## Q3 Aggregate functions, numerical logic and grouping

1. Find the average gpa of all students.
2. SELECT the student with the maximum gpa, display only their student_id, major and gpa
3. SELECT the student with the minimum gpa, display only their student_id, major and gpa
4. SELECT the students with a gpa greater than 3.6 in the majors of "Physics" and "Engineering", display only their student_id, major and gpa
5. Group the students by their major and retrieve the average grade of each major.
6. SELECT the top 2 students with the highest GPA in each major and order the results by major in ascending order, then by GPA in descending order

# Your solution

In [96]:
import sqlite3
import pandas as pd

In [2]:
# creating a new database here
conn = sqlite3.connect("students.db")
cursor = conn.cursor()

In [9]:
create_command = """
                 CREATE TABLE students (
                 student_id INTEGER PRIMARY KEY,
                 name VARCHAR(20),
                 major VARCHAR(30),
                 GPA FLOAT,
                 enrollment_date DATE);
                 """

In [10]:
cursor.execute(create_command)
print("Table created successfully!!")
conn.commit()

Table created successfully!!

In [8]:
# delete_command = """
#                  DROP TABLE students
#                  """
# cursor.execute(delete_command)
# conn.commit()

In [11]:
students = [
            (1, "John", "Computer Science", 3.5, "01-01-2022"),
            (2, "Jane", "Physics", 3.8, "01-02-2022"),
            (3, "Bob", "Engineering", 3.0, "01-03-2022"),
            (4, "Samantha", "Physics", 3.9, "01-04-2022"),
            (5, "James", "Engineering", 3.7, "01-05-2022"),
            (6, "Emily", "Computer Science", 3.6, "01-06-2022"),
            (7, "Michael", "Computer Science", 3.2, "01-07-2022"),
            (8, "Jessica", "Engineering", 3.8, "01-08-2022"),
            (9, "Jacob", "Physics", 3.4, "01-09-2022"),
            (10, "Ashley", "Physics", 3.9, "01-10-2022"),
           ]

In [12]:
cursor.executemany("INSERT INTO students VALUES (?, ?, ?, ?, ?)", students)
print("Data inserted successfully!!")
conn.commit()

Data inserted successfully!!

In [23]:
cursor.execute("""SELECT *
                  FROM students
                  WHERE name LIKE '%e%'""").fetchall()

[(2, 'Jane', 'Physics', 3.8, '01-02-2022'),
 (5, 'James', 'Engineering', 3.7, '01-05-2022'),
 (6, 'Emily', 'Computer Science', 3.6, '01-06-2022'),
 (7, 'Michael', 'Computer Science', 3.2, '01-07-2022'),
 (8, 'Jessica', 'Engineering', 3.8, '01-08-2022'),
 (10, 'Ashley', 'Physics', 3.9, '01-10-2022')]

## Q1 Simple SELECTS (on the students table)

In [24]:
cmd1 = """
        SELECT * FROM students
       """
cmd2 = """
        SELECT * FROM students
        WHERE major = 'Computer Science'
       """
cmd3 = """SELECT DISTINCT(major) AS unique_major
          FROM students
          ORDER BY major DESC"""
cmd4 = """SELECT *
          FROM students
          WHERE name LIKE '%e%'"""

In [119]:
print("SELECT all records in the table.")
print(pd.read_sql_query(cmd1, conn))
print("\n")

print("SELECT students whose major is Computer Science.")
print(pd.read_sql_query(cmd2, conn))
print("\n")

print("SELECT unique majors")
print(pd.read_sql_query(cmd3, conn))
print("\n")

print("SELECT all students with letter e in their name")
print(pd.read_sql_query(cmd4, conn))

SELECT all records in the table.
   student_id      name             major  GPA enrollment_date
0           1      John  Computer Science  3.5      01-01-2022
1           2      Jane           Physics  3.8      01-02-2022
2           3       Bob       Engineering  3.0      01-03-2022
3           4  Samantha           Physics  3.9      01-04-2022
4           5     James       Engineering  3.7      01-05-2022
5           6     Emily  Computer Science  3.6      01-06-2022
6           7   Michael  Computer Science  3.2      01-07-2022
7           8   Jessica       Engineering  3.8      01-08-2022
8           9     Jacob           Physics  3.4      01-09-2022
9          10    Ashley           Physics  3.9      01-10-2022


SELECT students whose major is Computer Science.
   student_id     name             major  GPA enrollment_date
0           1     John  Computer Science  3.5      01-01-2022
1           6    Emily  Computer Science  3.6      01-06-2022
2           7  Michael  Computer Science  3.2      01-07-2022


SELECT unique majors
       unique_major
0           Physics
1       Engineering
2  Computer Science


SELECT all students with letter e in their name
   student_id     name             major  GPA enrollment_date
0           2     Jane           Physics  3.8      01-02-2022
1           5    James       Engineering  3.7      01-05-2022
2           6    Emily  Computer Science  3.6      01-06-2022
3           7  Michael  Computer Science  3.2      01-07-2022
4           8  Jessica       Engineering  3.8      01-08-2022
5          10   Ashley           Physics  3.9      01-10-2022

In [64]:
course_create_command = """
                        CREATE TABLE courses (
                        course_id INTEGER,
                        course_name VARCHAR(20),
                        student_id VARCHAR(20),
                        grade VARCHAR(1),
                        FOREIGN KEY (student_id) REFERENCES students(student_id));
                        """

In [65]:
cursor.execute(course_create_command)
print("Table created successfully!!")
conn.commit()

Table created successfully!!

In [66]:
courses = [
            (1, "Python Programming", 1, "A"),
            (2, "Data Structures", 2, "B"),
            (3, "Database Systems", 3, "B"),
            (1, "Python Programming", 4, "A"),
            (4, "Quantum Mechanics", 5, "C"),
            (1, "Python Programming", 6, "F"),
            (2, "Data Structures", 7, "C"),
            (3, "Database Systems", 8, "A"),
            (4, "Quantum Mechanics", 9, "A"),
            (2, "Data Structures", 10, "F")
          ]

In [67]:
cursor.executemany("INSERT INTO courses VALUES (?, ?, ?, ?)", courses)
print("Data inserted successfully!!")
conn.commit()

Data inserted successfully!!

## Q2 Joins

In [116]:
# 1. COUNT the number of unique courses.

pd.read_sql_query(""" 
    SELECT COUNT(DISTINCT(course_id)) AS unique_courses
    FROM courses
""", conn)

   unique_courses
0               4

In [111]:
# 2. JOIN the tables students and courses and COUNT the number of students with the major Computer Science taking the course Python programming.

pd.read_sql_query(""" 
    SELECT COUNT("*") AS count_students
    FROM students
    INNER JOIN courses
    ON students.student_id = courses.student_id
    WHERE students.major = 'Computer Science' AND courses.course_name = 'Python Programming'
""", conn)

   count_students
0               2

In [109]:
# 3. JOIN the tables students and courses and select the students who have grades higher than "C", only show their name, major, gpa, course_name and grade.

pd.read_sql_query("""
SELECT name, major, gpa, course_name, grade
FROM students
INNER JOIN courses
ON students.student_id = courses.student_id
WHERE grade < 'C'
""", conn)

       name             major  GPA         course_name grade
0      John  Computer Science  3.5  Python Programming     A
1      Jane           Physics  3.8     Data Structures     B
2       Bob       Engineering  3.0    Database Systems     B
3  Samantha           Physics  3.9  Python Programming     A
4   Jessica       Engineering  3.8    Database Systems     A
5     Jacob           Physics  3.4   Quantum Mechanics     A

## Q3 Aggregate functions, numerical logic and grouping

In [108]:
# 1. Find the average gpa of all students.

pd.read_sql_query("""
                SELECT AVG(gpa) AS avg_gpa
                FROM students
               """, conn)

   avg_gpa
0     3.58

In [106]:
# 2. SELECT the student with the maximum gpa, display only their student_id, major and gpa

pd.read_sql_query("""
                SELECT student_id, major, MAX(gpa) AS max_gpa
                FROM students
               """, conn)

   student_id    major  max_gpa
0           4  Physics      3.9

In [105]:
# 3. SELECT the student with the minimum gpa, display only their student_id, major and gpa

pd.read_sql_query("""
                SELECT student_id, major, MIN(gpa) AS min_gpa
                FROM students
               """, conn)

   student_id        major  min_gpa
0           3  Engineering      3.0

In [103]:
# 4. SELECT the students with a gpa greater than 3.6 in the majors of "Physics" and "Engineering", display only their student_id, major and gpa

pd.read_sql_query("""
                SELECT student_id, major, gpa
                FROM students
                WHERE gpa > 3.6 AND major IN ('Physics', 'Engineering')
               """, conn)

   student_id        major  GPA
0           2      Physics  3.8
1           4      Physics  3.9
2           5  Engineering  3.7
3           8  Engineering  3.8
4          10      Physics  3.9

In [102]:
# 5. Group the students by their major and retrieve the average grade of each major.

pd.read_sql_query("""
SELECT major, AVG(gpa) AS avg_gpa
FROM students
GROUP BY major
""", conn)

              major   avg_gpa
0  Computer Science  3.433333
1       Engineering  3.500000
2           Physics  3.750000

In [100]:
# 6. SELECT the top 2 students with the highest GPA in each major and order the results by major in ascending order, then by GPA in descending order

pd.read_sql_query("""
                SELECT * FROM (
                SELECT *, ROW_NUMBER() OVER (PARTITION BY major 
                ORDER BY major, gpa DESC) AS no
                FROM students
                )RNK
                WHERE no <=2
               """, conn)

   student_id      name             major  GPA enrollment_date  no
0           6     Emily  Computer Science  3.6      01-06-2022   1
1           1      John  Computer Science  3.5      01-01-2022   2
2           8   Jessica       Engineering  3.8      01-08-2022   1
3           5     James       Engineering  3.7      01-05-2022   2
4           4  Samantha           Physics  3.9      01-04-2022   1
5          10    Ashley           Physics  3.9      01-10-2022   2